{"patient_id":"1001","name":"John Smith","phone":"+14155551234","age":45,"gender":"Male","surgery_type":"ACL reconstruction","surgery_date":"2026-02-11","risk_factors":["diabetes","obesity"],"doctor_notes":"Post-op day 2 after ACL reconstruction. Pain is moderate and expected; patient reports soreness with activity but can perform gentle range-of-motion exercises. Incisions are clean and dry with minimal swelling; no fever, chills, or drainage reported. Because of diabetes and obesity, I emphasized strict wound care, daily skin checks, and early reporting of redness or warmth. Reinforced DVT precautions (ankle pumps, walking as tolerated) and adherence to PT schedule; follow-up in 7–10 days for wound check.","medical_report_summary":"Operative report notes arthroscopic ACL reconstruction completed without intraoperative complications and stable graft fixation. Post-anesthesia recovery was uneventful, with vitals stable and pain controlled on discharge regimen. Discharge instructions include brace use, protected weight-bearing, icing/elevation, and PT initiation within the first week. Red-flag instructions include fever, worsening calf pain/swelling, increasing incision redness, or persistent drainage. Medication list includes acetaminophen/NSAID as tolerated and short-course opioid for breakthrough pain.","call_history":[{"call_id":"1001-1","call_date":"2026-02-12","summary":"Patient reports pain 6/10 when standing, improved to 3/10 at rest. Mild swelling around knee; using ice and elevation. No fever or drainage; incision looks 'fine' per patient. Taking meds as prescribed and started ankle pumps. Plan: continue brace and icing, encourage short walks, remind to monitor for redness/warmth and calf pain.","status":"stable","follow_up_recommended":"48h"}]}
{"patient_id":"1002","name":"Maria Gonzalez","phone":"+14155552345","age":62,"gender":"Female","surgery_type":"Total knee replacement","surgery_date":"2026-02-09","risk_factors":["hypertension"],"doctor_notes":"Post-op day 4 after total knee replacement. Patient is progressing but needs consistent pain control to participate fully in physical therapy. Surgical dressing is intact with expected bruising; no concerning drainage or odor reported. Blood pressure has been stable on home medications; advised monitoring since pain and reduced mobility can elevate readings. Reviewed constipation prevention, hydration, and safe ambulation with walker to reduce fall risk. Reinforced warning signs: fever, increasing redness, new calf pain, sudden shortness of breath, or inability to bear weight compared to yesterday.","medical_report_summary":"Surgery completed with cemented implant placement and good alignment noted in operative note. Postoperative labs show mild anemia consistent with surgery but no evidence of acute bleeding. Physical therapy evaluation cleared patient for home with walker and home PT services. Discharge summary outlines multimodal pain regimen, anticoagulation prophylaxis, and wound care instructions. Follow-up scheduled in 2 weeks for staple removal and range-of-motion assessment.","call_history":[{"call_id":"1002-1","call_date":"2026-02-10","summary":"Patient reports pain 7/10 during exercises and difficulty sleeping; using walker and completing home PT basics. Dressing dry; mild warmth around knee but no spreading redness. BP reading at home slightly elevated compared to baseline. Plan: optimize pain schedule before PT, encourage frequent short walks, and monitor temperature and redness boundaries.","status":"needs_attention","follow_up_recommended":"24h"},{"call_id":"1002-2","call_date":"2026-02-12","summary":"Pain improved to 5/10 after adjusting medication timing; able to complete PT set. No fever; swelling stable and bruising expected. BP back near baseline. Plan: continue regimen, maintain hydration/constipation plan, and keep daily ROM log.","status":"stable","follow_up_recommended":"72h"}]}
{"patient_id":"1003","name":"David Chen","phone":"+14155553456","age":38,"gender":"Male","surgery_type":"Appendectomy","surgery_date":"2026-02-12","risk_factors":[],"doctor_notes":"Post-op day 1 after laparoscopic appendectomy. Patient reports mild abdominal soreness and shoulder tip discomfort from insufflation gas, which is common and should resolve with walking. Incisions are small and covered; instructed to keep them clean and avoid soaking for one week. No nausea or vomiting today; tolerating light meals and fluids. Reviewed activity guidance: avoid heavy lifting, but walk multiple times daily to reduce ileus risk. Red flags reviewed: fever, worsening abdominal pain, persistent vomiting, spreading redness, or drainage from incision sites.","medical_report_summary":"Operative note indicates uncomplicated laparoscopic removal of inflamed appendix with no perforation or abscess. Pathology pending but gross appearance consistent with acute appendicitis. Postoperative course in PACU was stable with adequate pain control and no respiratory issues. Discharge paperwork includes wound care, return precautions, and a gradual diet advancement plan. No antibiotics prescribed at discharge given non-perforated status; follow-up in 1–2 weeks.","call_history":[]}
{"patient_id":"1004","name":"Aisha Patel","phone":"+14155554567","age":55,"gender":"Female","surgery_type":"Hysterectomy","surgery_date":"2026-02-08","risk_factors":["anemia","smoking"],"doctor_notes":"Post-op day 6 following hysterectomy. Patient has baseline anemia, so fatigue is expected; emphasized rest balanced with gentle ambulation to prevent clots. Smoking increases wound-healing risk; strongly encouraged cessation and provided resources for nicotine replacement if desired. Incision discomfort is present but controlled; advised to avoid straining and heavy lifting. Reviewed vaginal bleeding expectations and instructed to report heavy bleeding, foul discharge, or escalating pelvic pain. Reinforced hydration, iron-rich diet, and medication adherence; follow-up visit should include hemoglobin check if symptoms persist.","medical_report_summary":"Surgical report documents hysterectomy completed without intraoperative complications and estimated blood loss within expected range. Postoperative labs show mild anemia but stable hemodynamics without transfusion requirement. Discharge summary includes pelvic rest instructions, activity restrictions, and pain management plan. No signs of infection during inpatient stay; vitals remained stable. Return precautions include fever, heavy bleeding, urinary retention, or worsening abdominal/pelvic pain.","call_history":[{"call_id":"1004-1","call_date":"2026-02-10","summary":"Patient reports fatigue and lightheadedness when standing quickly; pain 4/10 controlled with scheduled meds. Minimal spotting; no fever. Incision appears clean but patient continues smoking intermittently. Plan: encourage hydration, slow position changes, reinforce smoking cessation and monitor for increased bleeding.","status":"needs_attention","follow_up_recommended":"48h"},{"call_id":"1004-2","call_date":"2026-02-13","summary":"Fatigue improving; no further dizziness. Spotting resolved to minimal; no foul odor. Patient reduced smoking but not fully stopped. Plan: continue gradual activity, reinforce pelvic rest and wound care, and reassess at clinic follow-up.","status":"stable","follow_up_recommended":"1w"}]}
{"patient_id":"1005","name":"Michael Brown","phone":"+14155555678","age":70,"gender":"Male","surgery_type":"Coronary artery bypass","surgery_date":"2026-02-05","risk_factors":["heart disease","diabetes","hypertension"],"doctor_notes":"Post-op week 1 after CABG. This patient is high risk given age, diabetes, and hypertension, so daily symptom tracking is important. Reviewed sternal precautions, incentive spirometer use, and the need for short, frequent walks with rest breaks. Discussed blood sugar control as a key factor for wound healing and infection prevention. Patient should monitor weight daily and report sudden gains, increasing shortness of breath, or swelling. Reinforced medication adherence (antiplatelet, statin, beta blocker as prescribed) and immediate escalation for chest pain not relieved by rest.","medical_report_summary":"Operative note describes multi-vessel bypass completed successfully with stable intraoperative hemodynamics. Postoperative ICU course included brief ventilatory support and was uncomplicated; patient discharged once ambulating and tolerating diet. Discharge summary outlines sternal wound care, cardiac rehab referral, and strict return precautions. Labs show expected post-surgical anemia and controlled electrolytes at discharge. Home monitoring plan includes blood pressure, glucose, weight, and symptom diary for dyspnea, edema, and wound changes.","call_history":[{"call_id":"1005-1","call_date":"2026-02-08","summary":"Patient reports mild incisional discomfort and fatigue; walking 5 minutes twice daily. Blood sugars running higher than usual; BP controlled. No chest pressure, but mild ankle swelling at end of day. Plan: reinforce glucose checks, elevate legs, continue spirometer, and monitor daily weight.","status":"needs_attention","follow_up_recommended":"24h"},{"call_id":"1005-2","call_date":"2026-02-10","summary":"Blood sugar improved after diet adjustments; walking increased to 8 minutes twice daily. No new swelling; weight stable. Incision clean; no fever. Plan: continue gradual activity increase, keep logs, and call if dyspnea worsens or weight increases >2 lbs overnight.","status":"stable","follow_up_recommended":"72h"},{"call_id":"1005-3","call_date":"2026-02-12","summary":"Patient reports brief dizziness after standing; resolved with sitting. BP slightly low after morning meds. No chest pain; breathing unchanged. Plan: advise slower transitions, review med timing with cardiology if recurrent, and maintain hydration within cardiac plan.","status":"needs_attention","follow_up_recommended":"48h"}]}
{"patient_id":"1006","name":"Samantha Lee","phone":"+14155556789","age":29,"gender":"Female","surgery_type":"Gallbladder removal","surgery_date":"2026-02-13","risk_factors":["obesity"],"doctor_notes":"Post-op day 1 after laparoscopic cholecystectomy. Patient reports expected abdominal soreness and some nausea that improves with small meals. Obesity can increase risk of wound issues; stressed keeping incisions clean and dry and avoiding tight clothing rubbing the sites. Reviewed diet guidance: low-fat meals initially to reduce diarrhea and cramping. Encouraged walking to reduce gas pains and constipation from analgesics. Return precautions include fever, worsening right upper quadrant pain, persistent vomiting, yellowing of skin/eyes, or increasing redness/drainage at incisions.","medical_report_summary":"Operative report indicates gallbladder removed laparoscopically without bile duct injury and minimal blood loss. Pathology expected to show chronic cholecystitis; no complications noted. Post-op recovery was stable; patient discharged with anti-nausea medication and standard wound care instructions. Discharge summary includes gradual activity increase and avoidance of heavy lifting for at least one week. Follow-up recommended in 1–2 weeks or sooner for concerning symptoms.","call_history":[{"call_id":"1006-1","call_date":"2026-02-14","summary":"Patient reports nausea 3/10 and pain 5/10 when moving; tolerating crackers and fluids. Incisions appear clean; no fever. Mild diarrhea after fatty meal attempt. Plan: reinforce low-fat diet, continue hydration, and use prescribed anti-nausea medication as needed.","status":"stable","follow_up_recommended":"72h"}]}
{"patient_id":"1007","name":"Robert Johnson","phone":"+14155557890","age":64,"gender":"Male","surgery_type":"Hip replacement","surgery_date":"2026-02-07","risk_factors":["osteoporosis","hypertension"],"doctor_notes":"Post-op week 1 after hip replacement. Patient has osteoporosis, so fall prevention and assistive device compliance are critical. Pain is expected but should trend down; advised scheduling meds before PT sessions for better participation. Blood pressure should be monitored given reduced mobility and pain variability. Reviewed incision care, dressing changes, and signs of infection. Reinforced DVT prevention: walking, ankle pumps, and anticoagulation adherence if prescribed; immediate escalation for calf pain, swelling, or shortness of breath.","medical_report_summary":"Operative note documents total hip arthroplasty performed with appropriate implant positioning and stable fixation. Postoperative imaging confirms alignment without dislocation. PT/OT evaluation cleared patient for home with walker and home safety modifications. Discharge summary includes hip precautions, wound care, anticoagulation regimen, and follow-up for staple removal. No postoperative complications documented during inpatient stay; vitals stable at discharge.","call_history":[{"call_id":"1007-1","call_date":"2026-02-09","summary":"Patient reports pain 6/10 with walking; using walker consistently. No fever; incision dry. Reports mild constipation. Plan: adjust bowel regimen, encourage hydration and short walks, and review hip precautions to avoid dislocation.","status":"stable","follow_up_recommended":"72h"}]}
{"patient_id":"1008","name":"Emily Davis","phone":"+14155558901","age":41,"gender":"Female","surgery_type":"C-section","surgery_date":"2026-02-10","risk_factors":[],"doctor_notes":"Post-op day 3 after C-section. Patient reports expected incisional pain and fatigue while adjusting to newborn care. Reviewed wound care and keeping the incision dry, especially after showering. No heavy bleeding reported; lochia within expected range, but emphasized reporting heavy bleeding, clots, or foul-smelling discharge. Discussed warning signs of postpartum preeclampsia including severe headache, vision changes, or right upper quadrant pain. Encouraged hydration, nutrition, and gentle ambulation; follow-up with OB in 2 weeks or sooner if symptoms worsen.","medical_report_summary":"Delivery summary indicates uncomplicated C-section with healthy newborn and stable maternal vitals intraoperatively. Postpartum course included routine pain management and ambulation; no infection signs during hospitalization. Discharge instructions include incision care, activity limitations, and postpartum warning signs. Hemoglobin mildly decreased as expected postpartum but stable without transfusion. Follow-up schedule includes incision check and postpartum visit; advised to seek immediate care for severe bleeding or neurologic symptoms.","call_history":[{"call_id":"1008-1","call_date":"2026-02-12","summary":"Patient reports pain 5/10, improving with scheduled meds. Incision clean; mild itching. Lochia light-to-moderate; no clots. Reports poor sleep and low appetite. Plan: encourage small frequent meals, hydration, and support resources; monitor for fever or heavy bleeding.","status":"stable","follow_up_recommended":"72h"},{"call_id":"1008-2","call_date":"2026-02-14","summary":"Patient reports new headache but no vision changes; BP at home not available. Bleeding unchanged; incision fine. Plan: recommend checking BP today, increase fluids, and escalate if headache persists, severe, or accompanied by vision/RUQ pain.","status":"needs_attention","follow_up_recommended":"24h"}]}
{"patient_id":"1009","name":"James Wilson","phone":"+14155559012","age":59,"gender":"Male","surgery_type":"Spinal fusion","surgery_date":"2026-02-06","risk_factors":["smoking","obesity"],"doctor_notes":"Post-op week 1 after spinal fusion. Patient has increased risk of delayed healing due to smoking and obesity; emphasized smoking cessation as critical for fusion success. Pain control is important but sedation and constipation must be monitored. Reviewed brace use, log-rolling technique, and restrictions on bending, lifting, and twisting. Encouraged short, frequent walks to prevent deconditioning and blood clots. Red flags include new leg weakness, loss of bowel/bladder control, fever, or increasing wound drainage; instructed to seek urgent evaluation if present.","medical_report_summary":"Operative note indicates spinal fusion completed with instrumentation placed as planned and stable neuromonitoring throughout. Postoperative imaging shows hardware in expected position. Hospital course included mobilization with PT and discharge with brace and pain regimen. Discharge summary outlines activity restrictions, wound care, and follow-up imaging schedule to assess fusion progress. No neurologic deficits documented at discharge; vitals stable. Smoking cessation counseling documented as part of discharge planning.","call_history":[{"call_id":"1009-1","call_date":"2026-02-08","summary":"Patient reports back pain 7/10 and difficulty sleeping; taking meds but worried about constipation. No new leg weakness; walking short distances indoors. Incision appears dry. Plan: optimize bowel regimen, encourage frequent brief walks, reinforce no bending/lifting/twisting.","status":"needs_attention","follow_up_recommended":"48h"},{"call_id":"1009-2","call_date":"2026-02-11","summary":"Pain improving to 5/10; constipation resolved with regimen. Patient admits to smoking 'a few' cigarettes. No fever; incision still dry. Plan: reinforce cessation importance for fusion healing, continue brace compliance, and monitor for any new neurologic symptoms.","status":"needs_attention","follow_up_recommended":"72h"}]}
{"patient_id":"1010","name":"Olivia Martinez","phone":"+14155550123","age":73,"gender":"Female","surgery_type":"Colon resection","surgery_date":"2026-02-04","risk_factors":["diabetes","hypertension","age_over_70"],"doctor_notes":"Post-op week 2 after colon resection. Given age and diabetes, closely monitor for dehydration, infection, and bowel function changes. Patient should track temperature, incision appearance, stool frequency, and appetite daily. Reviewed dietary progression toward higher protein and fiber as tolerated, while maintaining adequate fluids. Blood pressure and glucose monitoring remain important; advised contacting PCP for sustained elevations or hypoglycemia. Return precautions include fever, increasing abdominal pain, inability to pass stool/gas, persistent vomiting, or increasing incision redness/drainage.","medical_report_summary":"Surgical summary documents colon resection completed with primary anastomosis and no intraoperative complications. Postoperative course included gradual return of bowel function and transition to oral diet. Discharge summary emphasizes hydration, wound care, and monitoring for anastomotic leak symptoms (fever, severe abdominal pain, tachycardia). Labs show mild postoperative anemia and stable renal function at discharge. Follow-up plan includes surgeon visit and pathology review; diabetes management adjustments noted for recovery period.","call_history":[{"call_id":"1010-1","call_date":"2026-02-07","summary":"Patient reports low appetite and mild nausea; tolerating soups and fluids. Incision clean; no fever. Stools loose but present. Plan: encourage hydration, small frequent meals, and monitor for worsening abdominal pain or fever.","status":"stable","follow_up_recommended":"72h"},{"call_id":"1010-2","call_date":"2026-02-10","summary":"Patient reports improved appetite; stools more formed. Noted mild redness near incision edge without drainage. No fever but feels more tired. Plan: mark redness boundary, send photo if possible, and recheck in 24h given diabetes risk.","status":"needs_attention","follow_up_recommended":"24h"},{"call_id":"1010-3","call_date":"2026-02-13","summary":"Redness unchanged and not spreading; no drainage and temperature normal. Energy slightly improved. Plan: continue monitoring and keep wound clean/dry; keep follow-up appointment for in-person assessment.","status":"stable","follow_up_recommended":"1w"}]}